[
    {
        "courseName": "Apparel Design & Merchandising",
        "courseCode": "T33",
        "courseDetails": "Have you set your sights on a business course but need some time to explore the many possibilities it offers? Look no further! Our Common Business Programme (CBP) is specially designed to help you gain a good understanding of foundational business subjects. What more—you’ll get to study various core business subjects to discover your strengths, aptitudes, interests and career aspirations before you choose your preferred diploma towards the end of your first semester!",
        "imageUrl": "https://www.tp.edu.sg/staticfiles/TP/images/Schools/asc/dip-chemical-engineering/WCM%20Enhancement/che-banner.jpg",
        "year1": "Build a good foundation in fundamental business subjects. The early exposure to TP Fundamental subjects and business subjects in the first semester will better guide you to the course you want to pursue.",
        "year2": "Here, you will deepen your engineering skills, pick up fundamental knowledge of the life sciences, and learn how engineering is used to further the development of technology in the medical and life sciences fields.",
        "year3": "You can specialise by choosing an elective in Audiometry & Hearing Devices, Clinical Laboratory Equipment, or Medical Biochemistry. Together with the Major Project and internship, you will be ready for an exciting and lucrative career upon graduation."
    },
    {
        "courseName": "Communication Design",
        "courseCode": "T02",
        "courseDetails": "One is good but two is always better! This course will provide you with a dual specialisation in both accountancy and finance – giving you the ultimate flexibility when it comes to future career choices and further education options. With the government committed to promoting Singapore as a financial centre and wealth management hub, there will always be a demand for qualified accountancy and finance professionals. Our course’s robust and technology-driven curriculum will give you the upper hand by preparing you for today’s fintech environment. You could also clinch an invaluable internship opportunity with one of our partners, which include the Big Four accounting firms and other reputable multinational companies.",
        "imageUrl": "https://www.tp.edu.sg/staticfiles/TP/images/Schools/asc/dip-applied-food-science-and-nutrition/WCM%20Enhancement/fnc-banner.jpg",
        "year1": "To secure your future as a professional, first you need to get the fundamentals right. You will achieve this though modules such as Financial Accounting, Business Law, Economics & Cost Management Accounting.",
        "year2": "Increase your market value and employability prospects by gaining proficiency in high demand skills, including Corporate Accounting, Business Finance, Financial Analytics, Auditing and FinTech.",
        "year3": "Position yourself further through your choice of specialist elective modules, which will prepare you for post-diploma education and work in the Accountancy Profession or in the Financial Services Sector."
    },
    {
        "courseName": "Digital Film & Television",
        "courseCode": "T64",
        "courseDetails": "The healthcare industry needs Biomedical Engineers as much as doctors and nurses. You can make your mark in this growing sector by working with your peers to develop the next generation of medical devices and medicinal drugs. With Singapore on its way to becoming a global centre for medical research and advanced patient care, numerous international biomedical companies have already set up base here. So, if you have a passion to help improve the quality of lives for patients worldwide, then not only is this course perfect for you but it is also your stepping stone to excellent job opportunities and advancement prospects.",
        "imageUrl": "https://www.tp.edu.sg/staticfiles/TP/images/Schools/asc/dip-biotechnology/WCM%20Enhancement/mbt-banner.jpg",
        "year1": "You will receive a firm foundation in fundamental engineering concepts, through lab work, study trips to companies, and hands-on learning opportunities, preparing you for specialisation in the medical and life sciences fields.",
        "year2": "Here, you will deepen your engineering skills, pick up fundamental knowledge of the life sciences, and learn how engineering is used to further the development of technology in the medical and life sciences fields.",
        "year3": "You can specialise by choosing an elective in Audiometry & Hearing Devices, Clinical Laboratory Equipment, or Medical Biochemistry. Together with the Major Project and internship, you will be ready for an exciting and lucrative career upon graduation."
    }
]